---
kind: property
id: P:Autodesk.Revit.DB.DisciplineTypeId.Electrical
source: html/06514779-bae7-d4c2-0897-890130021d70.htm
---
# Autodesk.Revit.DB.DisciplineTypeId.Electrical Property

Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId Electrical { get; }
```